Tekla Open API Reference for Tekla Structures 2025
IntList.Insert Method
 Inserts the integer to the specified index.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Insert(
	int index,
	int value
)
Public Sub Insert (
	index As Integer,
	value As Integer
)
Parameters
index
Type: System.Int32
The index where the integer is inserted.
value
Type: System.Int32
The integer to be inserted.
See Also
Reference
IntList Class
Tekla.Structures.Drawing Namespace